Revit 2027 API
EnergyAnalysisMaterial.MaterialName Property
 The name of the material.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string MaterialName { get; }
Public ReadOnly Property MaterialName As String
	Get
public:
property String^ MaterialName {
	String^ get ();
}
member MaterialName : string with get
Property Value
String
See Also
Reference
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace